Repository: JiangNanGenius/floe-agent
Catalog: FloeAgent/FloeApp/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# packages.environment_management_service.verified_and_refreshed_packages
source: Verified and refreshed %@ packages
zh_hans: 已验证并刷新 %@ 个软件包

# packages.environment_management_service.verified_and_refreshed_packages.one
source: Verified and refreshed %@ package
zh_hans: 已验证并刷新 %@ 个软件包

# packages.node.auto
source: Automatic
zh_hans: 自动

# packages.node.effective
source: Used for this environment
zh_hans: 当前环境使用

# packages.node.manager
source: Package manager
zh_hans: 包管理器

# packages.node.policy
source: Automatic follows the owning project’s packageManager and lockfile; conflicts are shown before installation. An explicit choice applies to this environment. Uses the bundled CLI version and preserves project files.
zh_hans: 自动遵循所属项目的 packageManager 和锁文件，冲突时会先提示。手动选择只应用于本环境。使用 App 内置的管理器版本，保留项目文件。

# packages.registry.policy
source: This source applies to this environment for manual, Shell and Agent installations. Use a public HTTPS registry or Python Simple index. Keep credentials out of the URL. Changing the source keeps installed files and applies to the next transaction.
zh_hans: 此源用于当前环境的手动、Shell 和 Agent 安装。请填写公开的 HTTPS 仓库或 Python Simple 索引地址，勿在网址中放入凭据。修改不会删除现有依赖，下次安装时生效。

# packages.registry.restore
source: Restore official source
zh_hans: 恢复官方源

# packages.registry.source
source: Package source
zh_hans: 软件源

# packages.source.trust
source: Source Trust
zh_hans: 软件源信任

# packages.source.unsigned
source: Trust this unsigned source
zh_hans: 信任此无签名源

# packages.source.unsigned.help
source: Allows a missing signature only for this source. Invalid signatures and mismatched checksums still fail.
zh_hans: 仅允许此源缺少签名。签名无效或文件摘要不符仍会报错。

# pdf.reader.expand
source: Full Screen
zh_hans: 全屏

# pdf.reader.password
source: PDF password
zh_hans: PDF 密码

# pdf.reader.retry
source: Try Again
zh_hans: 重试

# pdf.reader.unlock
source: Unlock
zh_hans: 解锁

# pdf.reader.wrong_password
source: Incorrect password
zh_hans: 密码不正确

# persistence.creative_asset_store.asset_space_cleanup_is_conservatively_suspended
source: Asset space cleanup is conservatively suspended in this build: files are kept and will be released once the safe reclamation mechanism ships in a later version.
zh_hans: 素材空间清理已在当前版本保守挂起：文件已保留，将在后续版本的安全回收机制上线后释放。

# persistence.creative_asset_store.the_asset_reference_state_changed_no
source: The asset reference state changed; no local files were deleted this time.
zh_hans: 素材引用状态已变化，本次没有删除本地文件。

# persistence.creative_asset_store.the_canvas_index_is_temporarily_unreadable
source: The canvas index is temporarily unreadable; the asset was kept to avoid mistaken deletion. Try again later.
zh_hans: 画布索引暂时不可读，为避免误删已保留该素材；请稍后重试。

# persistence.creative_asset_store.this_asset_is_still_referenced_by
source: This asset is still referenced by canvas nodes or drawing version history and cannot be deleted.
zh_hans: 这个素材仍被画布中的节点或图纸版本历史引用，不能删除。

# persistence.creative_asset_store.this_asset_is_still_referenced_by_2
source: This asset is still referenced by %@ canvas nodes. Remove the references first.
zh_hans: 这个素材仍被 %@ 个画布节点引用。请先移除引用。

# persistence.creative_asset_store.this_asset_still_belongs_to_an
source: This asset still belongs to an unfinished media task and is not released until it ends.
zh_hans: 这个素材仍属于未完成的媒体任务，任务结束前不会释放。

# persistence.run_store.legacy_usage_label
source: Earlier tasks (not recorded)
zh_hans: 历史任务（未记录）

# plan.accept
source: Accept plan
zh_hans: 接受计划

# plan.title
source: Plan
zh_hans: 计划

# platform.background_run_coordinator.allowed_to_run_in_background
source: Allowed to run in background
zh_hans: 后台允许运行

# platform.background_run_coordinator.canceled_checkpoint_kept
source: Canceled · checkpoint kept
zh_hans: 已取消 · 检查点已保留

# platform.background_run_coordinator.cancellation_failed
source: Cancellation failed: %@
zh_hans: 取消失败：%@

# platform.background_run_coordinator.chars_sec
source: · %.1f chars/sec
zh_hans: · %.1f 字符/秒

# platform.background_run_coordinator.choose_a_usable_image_generation_model
source: Choose a usable image generation model under auxiliary models first.
zh_hans: 请先在辅助模型中选择可用的生图模型。

# platform.background_run_coordinator.download_returned_http
source: Download returned HTTP %@
zh_hans: 下载返回 HTTP %@

# platform.background_run_coordinator.failed
source: · failed %@
zh_hans: · 失败 %@

# platform.background_run_coordinator.floe_returned_to_the_foreground
source: Floe returned to the foreground
zh_hans: Floe 已回到前台

# platform.background_run_coordinator.generate_content
source: Generate content
zh_hans: 生成内容

# platform.background_run_coordinator.generate_image
source: Generate image %@
zh_hans: 生成图片 %@

# platform.background_run_coordinator.generating_media
source: Generating media
zh_hans: 正在生成媒体

# platform.background_run_coordinator.just_received_activity
source: Just received activity
zh_hans: 刚收到活动

# platform.background_run_coordinator.keep_running_in_background
source: Keep running in background
zh_hans: 后台保持运行

# platform.background_run_coordinator.model_tokens_s
source: · Model %.1f tokens/s
zh_hans: · 模型 %.1f tokens/s

# platform.background_run_coordinator.resuming_task_in_background
source: Resuming task in background
zh_hans: 正在后台继续任务

# platform.background_run_coordinator.run_failed_open_floe_to_recover
source: Run failed · open Floe to recover
zh_hans: 运行失败 · 打开 Floe 可恢复

# platform.background_run_coordinator.run_linux_environment_in_background
source: Run Linux environment in background
zh_hans: Linux 环境后台运行

# platform.background_run_coordinator.running
source: Running
zh_hans: 正在运行

# platform.background_run_coordinator.saved_to_the_conversation_workspace
source: Saved to the conversation workspace: %@
zh_hans: 已保存到对话工作区：%@

# platform.background_run_coordinator.sec_since_last_activity
source: %@ sec since last activity
zh_hans: 距上次活动 %@ 秒

# platform.background_run_coordinator.sharing_screen
source: Sharing screen
zh_hans: 正在共享屏幕

source: Submission was interrupted before the provider task ID was saved; whether the provider accepted it is unknown. It is not resubmitted automatically; check the provider console before retrying.
zh_hans: 提交在保存供应商任务 ID 之前中断；供应商是否已受理未知。不会自动重复提交，请核对供应商控制台后再决定是否重试。

# platform.background_run_coordinator.task_is_running
source: Task is running
zh_hans: 任务正在运行

# platform.background_run_coordinator.the_app_exited_and_the_linux
source: The app exited and the Linux environment stopped; reopen to restart and continue
zh_hans: 应用已退出，Linux 环境已停止；打开后可重新启动并继续

source: The conversation workspace is currently unavailable; the result was kept in the asset library (%@).
zh_hans: 对话工作区当前不可用；结果保留在素材库（%@）。

# platform.background_run_coordinator.the_download_exceeds_the_byte_limit
source: The download exceeds the %@-byte limit.
zh_hans: 下载结果超过 %@ 字节上限。

# platform.background_run_coordinator.the_environment_stopped_the_background_run
source: The environment stopped; the background-run preference is retained and applies again after restart
zh_hans: 环境已停止；后台运行偏好保留，重新启动后继续生效

# platform.background_run_coordinator.the_generated_image_exceeds_24_mib
source: The generated image exceeds 24 MiB.
zh_hans: 生成图片超过 24 MiB。

# platform.background_run_coordinator.the_generation_result_was_saved_to
source: The generation result was saved to the asset library and will be restored on the canvas.
zh_hans: 生成结果已保存到素材库，并会在画布中恢复。

# platform.background_run_coordinator.the_generation_result_was_saved_to_2
source: The generation result was saved to the asset library (jobID %@).
zh_hans: 生成结果已保存到素材库（jobID %@）。

# platform.background_run_coordinator.the_generation_result_was_saved_to_3
source: The generation result was saved to the asset library (%@).
zh_hans: 生成结果已保存到素材库（%@）。

# platform.background_run_coordinator.the_image_service_should_return_images
source: The image service should return %@ images but returned %@; partial results were not saved. Retry from the configuration node.
zh_hans: 图片服务应返回 %@ 张图片，但实际返回 %@ 张；本次没有保存部分结果，请从配置节点重试。

# platform.background_run_coordinator.the_linux_environment_keeps_running_the
source: The Linux environment keeps running; the status Picture in Picture reappears when you return to the background.
zh_hans: Linux 环境继续运行；返回后台时状态画中画会重新出现。

# platform.background_run_coordinator.the_provider_download_result_was_an
source: The provider download result was an empty file.
zh_hans: 供应商下载结果为空文件。

source: The provider reported completion but returned no downloadable video URL.
zh_hans: 供应商报告完成，但没有返回可下载的视频地址。

# platform.background_run_coordinator.the_provider_returned_an_insecure_download
source: The provider returned an insecure download URL.
zh_hans: 供应商返回了不安全的下载地址。

# platform.background_run_coordinator.the_provider_task_id_was_not
source: The provider task ID was not saved before cancellation; whether the provider accepted it is unknown. Check the provider console if needed.
zh_hans: 取消时尚未保存供应商任务 ID；供应商是否已受理未知，请在需要时核对供应商控制台。

# platform.background_run_coordinator.the_result_download_link_has_expired
source: The result download link has expired after its validity period (24 hours); generate it again.
zh_hans: 结果下载地址已在有效期（24 小时）后过期，请重新生成。

# platform.background_run_coordinator.the_selected_image_model_can_generate
source: The selected image model can generate at most %@ images at a time; this request asks for %@. Reduce the count or use a model that supports multiple images.
zh_hans: 所选图片模型单次最多生成 %@ 张图片；当前请求 %@ 张。请减少生成数量，或改用支持多图输出的模型。

# platform.background_run_coordinator.the_selected_image_model_supports_up
source: The selected image model supports up to %@ reference images; %@ are present. Remove reference images connected to the generation node or change the model.
zh_hans: 所选图片模型最多支持 %@ 张参考图；当前有 %@ 张。请减少连接到生成节点的参考图，或改用支持更多参考图的模型。

# platform.background_run_coordinator.the_selected_model_or_provider_does
source: The selected model or provider does not support reference-image editing.
zh_hans: 所选模型或服务商不支持参考图编辑。

# platform.background_run_coordinator.the_task_already_ended_and_cannot
source: The task already ended (%@) and cannot be canceled. Use video.status to see the final status.
zh_hans: 该任务已结束（%@），无法取消。使用 video.status 查看最终状态。

# platform.background_run_coordinator.the_task_completed_before_it_was
source: The task completed before it was canceled; results are downloading.
zh_hans: 任务在取消前已完成，结果正在下载。

# platform.background_run_coordinator.the_task_was_canceled_before_provider
source: The task was canceled before provider confirmation; cancellation of the provider task was attempted.
zh_hans: 任务在供应商确认前已被取消，已尝试取消供应商任务。

# platform.background_run_coordinator.the_video_was_generated_and_saved
source: The video was generated and saved to %@ (jobID %@). %@
zh_hans: 视频已生成并保存到 %@（jobID %@）。 %@

# platform.background_run_coordinator.this_stage_sec
source: %@ This stage %@ sec%@ %@%@%@
zh_hans: %@ 本阶段 %@ 秒%@ %@%@%@

# platform.background_run_coordinator.tool_call
source: Tool: %@ · call #%@%@
zh_hans: 工具：%@ · 第 %@ 次调用%@

# platform.background_run_coordinator.tool_calls
source: %@ tool calls%@
zh_hans: 工具调用 %@ 次%@

# platform.background_run_coordinator.tool_calls.one
source: %@ tool call%@
zh_hans: 工具调用 %@ 次%@

# platform.background_run_coordinator.video_is_ready
source: Video is ready
zh_hans: 视频已准备好

# platform.background_run_coordinator.waiting_for_approval
source: Waiting for approval: %@
zh_hans: 等待审批：%@

# platform.background_run_coordinator.waiting_for_your_approval
source: Waiting for your approval
zh_hans: 等待你的审批

# platform.background_run_coordinator.writing_to_the_conversation_workspace_failed
source: Writing to the conversation workspace failed: %@; the result was kept in the asset library (%@).
zh_hans: 对话工作区写入失败：%@；结果保留在素材库（%@）。

# platform.background_video_service.avkit_has_not_enabled_picture_in
source: AVKit has not enabled Picture in Picture yet; try again later from the task toolbar
zh_hans: AVKit 尚未允许画中画，请稍后从任务工具栏重试

# platform.background_video_service.close_picture_in_picture
source: Close Picture in Picture
zh_hans: 关闭画中画

# platform.background_video_service.could_not_create_the_picture_in
source: Could not create the Picture in Picture playback timeline
zh_hans: 无法创建画中画播放时间线

# platform.background_video_service.could_not_create_the_picture_in_2
source: Could not create the Picture in Picture progress screen
zh_hans: 无法创建画中画进度画面

# platform.background_video_service.displaying
source: Displaying
zh_hans: 正在显示

# platform.background_video_service.picture_in_picture_failed_to_start
source: Picture in Picture failed to start: %@
zh_hans: 画中画启动失败：%@

# platform.background_video_service.picture_in_picture_preparation_failed
source: Picture in Picture preparation failed
zh_hans: 画中画准备失败

# platform.background_video_service.picture_in_picture_ready
source: Picture in Picture ready
zh_hans: 画中画已就绪

# platform.background_video_service.prepare_picture_in_picture_again
source: Prepare Picture in Picture again
zh_hans: 重新准备画中画

# platform.background_video_service.preparing_picture_in_picture
source: Preparing Picture in Picture
zh_hans: 准备画中画

# platform.background_video_service.preparing_picture_in_picture_content
source: Preparing Picture in Picture content
zh_hans: 正在准备画中画内容

# platform.background_video_service.start_picture_in_picture
source: Start Picture in Picture
zh_hans: 启动画中画

# platform.background_video_service.starting_picture_in_picture
source: Starting Picture in Picture
zh_hans: 正在启动画中画

# platform.background_video_service.task_status
source: Task status
zh_hans: 任务状态

# platform.background_video_service.the_picture_in_picture_content_is
source: The Picture in Picture content is no longer valid; retry from the toolbar
zh_hans: 画中画内容已失效，请从工具栏重试

# platform.background_video_service.the_picture_in_picture_content_needs
source: The Picture in Picture content needs to be prepared again; retry from the toolbar
zh_hans: 画中画内容需要重新准备，请从工具栏重试

# platform.background_video_service.the_picture_in_picture_source_is
source: The Picture in Picture source is not connected to the app window yet; keep the app in the foreground and retry
zh_hans: 画中画来源尚未连接到应用窗口，请保持应用在前台后重试

# platform.background_video_service.the_system_cannot_start_picture_in
source: The system cannot start Picture in Picture right now; try again later
zh_hans: 当前系统暂时不能启动画中画，请稍后重试

# platform.background_video_service.the_system_did_not_finish_starting
source: The system did not finish starting Picture in Picture; tap again to retry
zh_hans: 系统没有完成画中画启动，请再次点击重试

# platform.background_video_service.this_device_does_not_support_picture
source: This device does not support Picture in Picture
zh_hans: 当前设备不支持画中画

# platform.background_video_service.waiting_for_avkit_to_be_ready
source: Waiting for AVKit to be ready
zh_hans: 正在等待 AVKit 就绪

# platform.background_video_service.waiting_for_the_task_to_start
source: Waiting for the task to start
zh_hans: 等待任务启动

# plugins.discover
source: Discover
zh_hans: 发现

# plugins.enable
source: Enable
zh_hans: 启用

# plugins.import
source: Import a plugin
zh_hans: 导入插件

# plugins.installed
source: Installed
zh_hans: 已安装

# plugins.network.summary
source: Check connections and troubleshoot network issues.
zh_hans: 检查连接，排查网络问题。

# plugins.office.summary
source: Create documents, spreadsheets and presentations; edit text and cells.
zh_hans: 创建文档、表格和幻灯片，修改文字与单元格内容。

# plugins.official
source: Official plugins
zh_hans: 官方插件

# plugins.pdf.summary
source: Read and edit PDFs, fill forms and arrange pages.
zh_hans: 阅读与编辑 PDF、填写表单、整理页面。

# plugins.ready
source: Ready to use
zh_hans: 已启用

# plugins.search
source: Search plugins
zh_hans: 搜索插件

# plugins.title
source: Plugins
zh_hans: 插件

# plugins.unavailable
source: Unavailable in this build
zh_hans: 此版本暂不可用

# portforward.add
source: Add
zh_hans: 添加

# portforward.add_rule
source: Add port-forwarding rule
zh_hans: 添加端口转发规则

# portforward.add_title
source: Add port forwarding
zh_hans: 添加端口转发

# portforward.applied
source: Active
zh_hans: 已生效

# portforward.copied
source: Copied
zh_hans: 已复制

# portforward.copy
source: Copy
zh_hans: 复制

# portforward.delete
source: Delete
zh_hans: 删除

# portforward.dynamic
source: Dynamic
zh_hans: 动态

# portforward.enable
source: Enabled
zh_hans: 启用

# portforward.fixed
source: Fixed
zh_hans: 固定

# portforward.footer
source: Each rule publishes one Linux TCP port to this device. The iPad port can be fixed or assigned automatically (49152–65535); at most %1$lld rules per environment. The default bind address is %2$@ (reachable on your local network). Floe does not set up UPnP/NAT mapping and shows no public address.
zh_hans: 每条规则把 Linux 的一个 TCP 端口发布到本机；iPad 端口可固定或自动分配（49152–65535），每个环境最多 %1$lld 条。默认绑定 %2$@（同一局域网可访问）。应用不做 UPnP/NAT 映射，也不显示公网地址。

# portforward.guest_invalid
source: The Linux port must be a whole number from 1 to 65535.
zh_hans: Linux 端口必须是 1–65535 的整数。

# portforward.guest_port
source: Linux port %lld
zh_hans: Linux 端口 %lld

# portforward.guest_port_field
source: Linux port
zh_hans: Linux 端口

# portforward.host_invalid
source: The fixed iPad port must be between %1$lld and %2$lld, or leave it blank for automatic assignment.
zh_hans: 固定 iPad 端口必须在 %1$lld–%2$lld 之间，或留空使用自动分配。

# portforward.host_port
source: iPad port %@
zh_hans: iPad 端口 %@

# portforward.host_port_field
source: Fixed iPad port (leave blank for automatic)
zh_hans: 固定 iPad 端口（留空为自动分配）

# portforward.host_port_hint
source: The iPad port must be between %1$lld and %2$lld. Leave it blank to use the smallest free port in that range.
zh_hans: iPad 端口必须在 %1$lld–%2$lld 之间；留空时自动分配该范围内最小的空闲端口。

# portforward.loopback_hint
source: No local-network address found yet; the address shown only works on this iPad.
zh_hans: 尚未检测到局域网地址；显示的地址仅能在本机使用。

# portforward.name_optional
source: Name (optional)
zh_hans: 名称（可选）

# portforward.new_rule
source: New rule
zh_hans: 新规则

# portforward.no_local_address
source: No local address available
zh_hans: 当前没有可用的本地地址

# portforward.pending
source: Waiting
zh_hans: 待应用

# portforward.port
source: Port %lld
zh_hans: 端口 %lld

# portforward.qr_hint
source: The QR code contains only this address; it includes no public mapping.
zh_hans: 二维码仅包含该地址，不包含任何公网映射。

# portforward.qr_label
source: QR code for the port-forwarding address
zh_hans: 端口转发地址二维码

# portforward.remapped
source: Fixed port %1$lld was busy; using %2$lld instead.
zh_hans: 固定端口 %1$lld 已被占用，已改用 %2$lld。

# portforward.show_qr
source: Show QR code
zh_hans: 显示二维码

# portforward.title
source: TCP port forwarding
zh_hans: TCP 端口转发

# privacy.point.local
source: Your data stays on your device and your iCloud
zh_hans: 数据仅保存在你的设备和你的 iCloud

# privacy.point.no_backend
source: No Floe backend or account
zh_hans: 没有 Floe 后端或账号

# privacy.point.no_tracking
source: No analytics, ads, or tracking
zh_hans: 无分析、广告或跟踪

# privacy.point.secrets
source: Secrets live only in your Keychain
zh_hans: 密钥仅存储于你的钥匙串

# providers.add
source: Add Provider
zh_hans: 添加提供商

# providers.add_model
source: Add Model
zh_hans: 添加模型

# providers.allow_plain_http
source: Allow plain HTTP (local/private only)
zh_hans: 允许明文 HTTP（仅限本地/内网）

# providers.api_key
source: API key
zh_hans: API 密钥

# providers.api_key.hint
source: Stored only in Keychain, never in the database.
zh_hans: 仅存储于钥匙串，绝不写入数据库。

# providers.auxiliary_models_view.add_and_maintain_video_models_under
source: Add and maintain video models under “Model providers”; here you only choose the model the agent uses by default.
zh_hans: 在“模型服务商”中添加和维护视频模型；这里仅选择 Agent 默认使用的模型。

# providers.auxiliary_models_view.auto_saved
source: Auto-saved
zh_hans: 已自动保存

# providers.auxiliary_models_view.auto_saving
source: Auto-saving
zh_hans: 正在自动保存

# providers.auxiliary_models_view.before_installing_a_python_package_floe
source: Before installing a Python package, Floe confirms it is genuinely needed by the current task. Packages that need extra system permissions or are unsuitable to run locally are still blocked.
zh_hans: 安装 Python 包前，会确认它确实用于当前任务。需要额外系统权限或不适合本机运行的包仍会被阻止。

# providers.auxiliary_models_view.currently_in_use
source: Currently in use
zh_hans: 当前实际使用

# providers.auxiliary_models_view.default_video_model
source: Default video model
zh_hans: 默认视频模型

# providers.auxiliary_models_view.follow_the_general_auxiliary_llm
source: Follow the general auxiliary LLM
zh_hans: 跟随通用辅助 LLM

# providers.auxiliary_models_view.follow_the_main_chat_model
source: Follow the main chat model
zh_hans: 跟随主对话模型

# providers.auxiliary_models_view.general_auxiliary_llm
source: General auxiliary LLM
zh_hans: 通用辅助 LLM

# providers.auxiliary_models_view.let_the_model_choose_the_image
source: Let the model choose the image configuration
zh_hans: 模型自主选择生图配置

# providers.auxiliary_models_view.lets_the_model_choose_configured_providers
source: Lets the model choose configured providers, image models and parameters per task. The presets below are preferences and fallbacks; when off, the specified model is used.
zh_hans: 允许模型按任务选择已配置的供应商、图像模型和参数。下方预设作为优先选择和备选；关闭后使用指定模型。

# providers.auxiliary_models_view.package_review
source: Package review
zh_hans: 软件包审查

# providers.auxiliary_models_view.package_review_model
source: Package review model
zh_hans: 软件包审查模型

# providers.auxiliary_models_view.text_assistance
source: Text assistance
zh_hans: 文本辅助

# providers.auxiliary_models_view.the_selected_model_is_unavailable_choose
source: The selected model is unavailable; choose again
zh_hans: 所选模型不可用，请重新选择

# providers.auxiliary_models_view.unsaved
source: Unsaved
zh_hans: 未保存

# providers.auxiliary_models_view.used_for_memory_organization_user_profiles
source: Used for memory organization, user profiles, skill extraction and automatic titles. Vision understanding, images and video use their own models below.
zh_hans: 用于记忆整理、用户画像、技能提炼与自动标题。视觉理解、图片和视频使用下方各自的模型。

# providers.base_url
source: Base URL
zh_hans: 基础 URL

# providers.credentials
source: Credentials
zh_hans: 凭据

# providers.delete_failed
source: Unable to delete provider
zh_hans: 无法删除服务商

# providers.discovered
source: Discovered
zh_hans: 已发现

# providers.display_name
source: Name
zh_hans: 名称

# providers.edit
source: Edit Provider
zh_hans: 编辑提供商

# providers.enabled
source: Enable provider
zh_hans: 启用供应商

# providers.endpoint
source: Endpoint
zh_hans: 端点

# providers.headers_hint
source: Non-secret headers only. Secrets never go here.
zh_hans: 仅填写非机密请求头，密钥请勿填在这里。

# providers.headers_placeholder
source: Header: value (one per line)
zh_hans: 请求头: 值（每行一个）

source: Alibaba Cloud image editing supports up to 2K; lower the resolution and try again.
zh_hans: 阿里云图片编辑最高支持 2K，请降低分辨率后重试。

source: Invalid OpenAI image quality parameter: %@.
zh_hans: OpenAI 图片质量参数无效：%@。

# providers.image_generation_preset_resolver.the_current_image_model_does_not
source: The current image model does not support aspect ratio %@.
zh_hans: 当前图片模型不支持画面比例 %@。

# providers.image_generation_preset_resolver.the_current_image_model_does_not_2
source: The current image model does not support resolution %@.
zh_hans: 当前图片模型不支持分辨率 %@。

source: The selected Alibaba Cloud image model does not support 4K.
zh_hans: 所选阿里云图片模型不支持 4K。

# providers.image_generation_preset_resolver.the_selected_seedream_model_does_not
source: The selected Seedream model does not support resolution %@.
zh_hans: 所选 Seedream 模型不支持分辨率 %@。

# providers.image_provider_adapter.does_not_support_image_actions
source: %@ does not support image actions %@.
zh_hans: %@ 不支持图片操作 %@。

# providers.image_provider_adapter.supports_up_to_reference_images_are
source: %@%@ supports up to %@ reference images; %@ are present. Remove reference images explicitly connected to the generation node, or use a model that supports more.
zh_hans: %@%@ 最多支持 %@ 张参考图；当前有 %@ 张。请减少明确连接到生成节点的参考图，或改用支持更多参考图的模型。

# providers.image_provider_adapter.the_current_model_can_generate_at
source: The current %@ model can generate at most %@ images at a time; this request asks for %@. Reduce the count or use a model that supports multiple images.
zh_hans: %@ 当前模型单次最多生成 %@ 张图片；当前请求 %@ 张。请减少生成数量，或改用支持多图输出的模型。
